Autodesk.Revit.DB.DividedPathMeasurementType
Since:
2013
DividedPath measurement type.
Since:
2013

Autodesk.Revit.DB.DividedPathMeasurementType.SegmentLength
Distances between two points are measured along the path segment between the points.

Autodesk.Revit.DB.DividedPathMeasurementType.ChordLength
Distances between two points are measured along a straight line between the points.